import { FooterLogo, MainLogo } from '@/images'
import { cn } from '@/lib/utils'
import Image from 'next/image'
import React from 'react'

const PreviousVersion = () => {
    return (
        <div className='w-full max-w-[1440px] mx-auto lg:px-[137px]'>

                <div className='w-full max-w-[1440px]  bg-primary-500'>
                    <Image
                        className=' w-auto'
                        src={MainLogo}
                        alt='Picture of the author'
                    />
                    <Image
                        className=' w-auto lg:h-[60px]'
                        src={FooterLogo}
                        alt='Footer Logo'
                    />

            </div>
            <div className='py-16 '>
                <h1 className='text-[50px] text-destructive-500 font-bold'>المسارات</h1>


                <div className='-mt-8'>
                    <TextField
                        title={"نظرة عامة على النسخة الأولى:"}
                        subTitle={"أطلق صندوق التنمية الصناعية السعودي \"هاكاثون الصناعة\" الأول من نوعه على مستوى المملكة، ويهدف الصندوق الصناعي من إقامته \"هاكاثون الصناعة\" والذي يأتي تحت شعار \"حلول إبداعية، لتحديات صناعية\"، إلى توفير منصة تربط أفكار وإبداعات الشباب والشابات السعوديين، باحتياجات المُصنعين الوطنيين؛ لإمدادهم بحلولٍ فعالةٍ للمشكلات التي تواجههم في تسويق المنتجات، والتغليف، والتصميم وصناعة الهوية البصرية، ما يُسهم في دعم جاذبية المنتجات السعودية بين المنتجات العالمية، ويحقق تقدمًا في رفع مؤشر رضا العملاء عن المنتجات الوطنية."}
                    />

                    <TextField
                        title='الجدول الزمني للنسخة الأولى:'
                        subTitle='أوضح الصندوق الصناعي أن التسجيل قد بدأ في الهاكاثون ويستمر حتى 11 يونيو المقبل، يتبع ذلك إعلان الفرق المترشحة للمعسكر الذي سيقام في 16 من الشهر نفسه، كما بيّن الصندوق بأن المعسكر التدريبي سينطلق في تاريخ 22 وحتى 24 من يونيو المقبل، ليُختَتم الهاكاثون في حفل تكريم الفرق الفائزة في 25 من الشهر ذاته.'
                    />
                    <TextField
                        title="الرعاة:"
                        subTitle="ُقيمت تلك النسخة بالشراكة مع برنامج صُنع في السعودية، وبرعايةٍ من شركة معادن، شركة سابك، وبنك الرياض."
                    />

                    <TextFieldWithList
                        className="list-decimal"
                        title="رحلة المشاركين في النسخة الأولى:"
                        subTitle={`تشمل رحلة المشاركين في "هاكاثون الصناعة" عدة مراحل، تبدأ باختيار الفريق المشارك وتسجيله في موقع الهاكاثون الإلكتروني، ومن ثم اختيار التحدي الذي يرغب الفريق في إيجاد الحلول له، مرورًا بحضور ورش عمل افتراضية لتأهيل الفرق وأعضائها لخوض التحديات بأساليب علمية، لتُفرَز بعد ذلك الحلول المُقدَّمة من قِبَل الفرق بعد تقديم العروض الأولية، ثم تُطوَّر من خلال معسكر الهاكاثون، مع التزام المشاركين بورش العمل الحضورية، وأخيراً تقديم العروض النهائية لاختيار الفائزين.`}
                        lists={[
                            "تقدم للهاكاثون 2590 شخص",
                            "تم فرز 200 متقدم يمثلون 61 فريق",
                            "بنهاية اليوم الثاني من المعسكر التدريبي تأهل 32 فريق",
                            "وبعد مرحلة التحكيم تأهلت 10 فرق للمرحلة النهائية في الحفل الختامي",
                            "توج خمسة فرق منهم بالمراكز الخمسة الأولى"
                        ]}
                    />

                    <TextField
                        title="أصحاب التحديات:"
                        subTitle='طرحت 8 منشآت عاملة في مجال صناعة الأغذية تحديات على مستوى تسويق المنتجات وتغليفها بأساليب إبداعية.'
                    />

                    <TextField
                        title="عدد التحديات:"
                        subTitle='تنافس المشاركون في النسخة الأولى من هاكاثون الصناعة على إيجاد حلول إبداعية لـ 12 تحدياً حقيقياً في مجالات التغليف، والتصميم، وصناعة الهوية البصرية، وتسويق المنتجات، لصالح عددٍ من الشركات والمصانع الوطنية.'
                    />

                    <TextFieldWithList
                        className="list-disc"
                        title="إحصائيات فترة التسجيل في النسخة الأولى:"
                        subTitle=''
                        lists={[
                            "فترة التسجيل: 27 يومًا من 15 مايو وحتى 11 يونيو",
                            "عدد المسجلين: 2,590",
                            "إجمالي المشاركات المكتملة: 411",
                            "عدد الفرق: 61",
                            "6 ورش عمل",
                            "6 مدربين",
                            "6 ساعات تدريبية",
                            "نسبة الذكور والإناث: 40% من الذكور و60% من الإناث",
                            "موظفي القطاع الخاص: 8%",
                            "موظفي القطاع الحكومي: 21%",
                            "المستقلين: 16%",
                            "الطلاب: 55%",
                            "زوار موقع الهاكاثون: 75,000"

                        ]}
                    />
                    <TextFieldWithList
                        className="list-disc"
                        title="الجوائز:"
                        subTitle='تبلغ قيمة الجوائز المرصودة للفائزين في الهاكاثون 250 ألف ريال سعودي موزعة على المراكز الخمسة الأولى بالشكل الآتي:'
                        lists={[
                            "المركز الأول: 80 ألف ريال",
                            "المركز الثاني: 60 ألف ريال",
                            "المركز الثالث: 45 ألف ريال",
                            "المركز الرابع: 35 ألف ريال",
                            "المركز الخامس: 30 ألف ريال"
                        ]}
                    />

                    {/* one field is required to add here */}

                    <TextField
                        title="نظرة عامة على النسخة الثانية:"
                        subTitle='يأتي تنظيم الصندوق الصناعي لهاكاثون الصناعة في نسخته الثانية، تحت شعار "دع أفكارك تُضيء"، وذلك برعاية معالي وزير الصناعة والثروة المعدنية، رئيس مجلس إدارة الصندوق الصناعي الأستاذ بندر بن إبراهيم الخريّف، تأكيدًا على نجاح النسخة الأولى، وما لقيته من تفاعل وصدى لدى المشاركين وأصحاب التحديات، وكذلك استمرارًا لجهود الصندوق في دعم المصنعين الوطنيين وتعزيز قيم الابتكار والإبداع التي تشكل ركيزة أساسية من ركائز تطور القطاع الصناعي.​ ويهدف هذا الهاكاثون إلى ربط أفكار المبدعين والمبدعات مع احتياجات المُصنّعين الوطنيين، لإيجاد حلول إبداعية للتحديات الصناعية التي تواجه المُصنّعين، بما يُسهم في تطوير المنتجات الوطنية، وتعزيز جاذبيتها على المستويين المحلي والعالمي.
        أطلق صندوق التنمية الصناعي الحدث الصناعي الأول من نوعه في المملكة "هاكاثون الصناعة" بنسخته الثانية على التوالي، والذي سيسهم بدوره في دعم الصناعة المحلية وتطويرها، وذلك عبر إتاحة الفرصة للجميع بأن يكونوا شركاء في معالجة التحديات التي يواجهها المصنّع الوطني اليوم. '
                    />


                    <TextField
                        title="الجدول الزمني للنسخة الثانية:"
                        subTitle={`تنقسم مراحل الهاكاثون إلى أربع مراحل: الأولى "مرحلة التسجيل" والتي تبدأ من 13 أغسطس إلى 31 أغسطس، والثانية "مرحلة الفرز" من 1 إلى 4 سبتمبر، والثالثة "مرحلة المعسكر التدريبي" وذلك يوميّ 14 و15 سبتمبر، ليُختَتَم الهاكاثون بالمرحلة الرابعة التي تتضمّن اختيار الفائزين والحفل الختامي يوم 16 سبتمبر.`}
                    />

                    <TextField
                        title="لرعاة:"
                        subTitle="تُقام النسخة الثانية من الهاكاثون بالشراكة مع جامعة الملك عبد الله للعلوم والتقنية بصفتها شريكاً للابتكار، وبنك الرياض بصفته شريكاً ماليًا، وشركة سبكيم بصفتها راعٍ بلاتيني."
                    />

                    <TextField

                        title='رحلة المشاركين في النسخة الثانية:'
                        subTitle='تتضمن رحلة المشاركين في النسخة الثانية من "هاكاثون الصناعة" أربع مراحل، الأولى "التسجيل" والتي بدأت من 13 إلى 31 أغسطس، والثانية "الفرز" من 1 إلى 4 سبتمبر والتي تُحدَّد فيها الفِرَق التي ستتأهل إلى مرحلة المعسكر التدريبي، والثالثة "المعسكر التدريبي" الذي يشمل إقامة ورش عمل حضورية وجلسات إرشادية للمشاركين يوميّ 14 و15 سبتمبر، ليُختَتَم الهاكاثون بالمرحلة الرابعة التي تتضمّن اختيار الفائزين والحفل الختامي يوم 16 سبتمبر.'
                    />

                    <TextField

                        title="أصحاب التحديات:"
                        subTitle='قدمت 8 منشآت عاملة في مجال القهوة والطباعة ثلاثية الأبعاد والإنتاج تحديات تتعلق ابتكار وحدات تخزين جديدة وخلق شكل جديد للقهوة السعودية وغيرها من التحديات.'
                    />


                    <TextField
                        title="عدد التحديات:"
                        subTitle={`يطرح "هاكاثون الصناعة 2023" 8 تحديات المُصنّعين الوطنيين عبر 3 مسارات، هي: التصميم، والإنتاج، والاستدامة، حيث بلغ عدد المُسجلين في مسار التصميم 2349 مُسجِّلاً، والاستدامة 1776 مُسجِّلاً، والإنتاج 1450 مُسجِّلاً.`}
                    />

                    <TextFieldWithList
                        className="list-disc"
                        title="إحصائيات فترة التسجيل في النسخة الثانية:"
                        subTitle=""
                        lists={[
                            "31 أغسطس عدد المسجلين: 5,575",
                            "إجمالي المشاركات المكتملة: 501",
                            "عدد الفرق: 57",
                            "نسبة الذكور والإناث: 43% من الذكور و57% من الإناث",
                            "موظفي القطاع الخاص: 17%",
                            "موظفي القطاع الحكومي: 8%",
                            "المستقلين: 14%",
                            "الطلاب: 61%",
                            "زوار موقع الهاكاثون: 119,651",
                            "بلغ عدد أعضاء الفرق المُسجِّلَة 3892 عضوًا",
                            "وصل عدد قادة الفرق إلى 1683 قائدًا",
                            "شكّل عدد الذكور منهم 730 قائدًا",
                            "جاء عدد الإناث 953 قائدة",
                            "استحوذت الفئة العمرية من 18 إلى 25 عاماً على النسبة الأكبر من عدد القادة بـ 1110 أشخاص",
                            "يطرح هاكاثون الصناعة تحديات المُصنّعين الوطنيين عبر 3 مسارات: التصميم، والإنتاج، والاستدامة",
                            "بلغ عدد المُسجلين في مسار التصميم 2349 مُسجِّلاً",
                            "بلغ عدد المُسجلين في مسار الاستدامة 1776 مُسجِّلاً",
                            "بلغ عدد المُسجلين في مسار الإنتاج 1450 مُسجِّلاً"
                        ]}

                    />

                    <TextField
                        title="الجوائز:"
                        subTitle='يبلغ مجموع جوائز "هاكاثون الصناعة" لعام 2023م أكثر من مليون ريال سعودي، توزّع على الفائزين والمشاركين.'
                    />

                    {/* one more field needed */}


                </div>
            </div>
        </div>
    )
}

export default PreviousVersion



const TextField = ({ title, subTitle }: { title?: string, subTitle: string }) => {
    return (
        <div className='my-[72px]'>
            <h1 className='text-2xl text-green-normal font-bold'>{title}</h1>
            <p className='text-lg mt-5'>{subTitle}</p>
        </div>
    )
}

const TextFieldWithList = ({ title, subTitle, lists, className }: { title?: string, subTitle: string, lists: string[], className?: string }) => {
    return (
        <div className='my-[72px]'>
            <h1 className='text-2xl text-green-normal font-bold'>{title}</h1>
            <p className='text-lg mt-5'>{subTitle}</p>
            <ul className={cn(" mr-5 mt-5", className)}>
                {lists.map((list, index) => <li key={index} className='text-lg my-2'>{list}</li>)}
            </ul>
        </div>
    )
}